XML_LAST_19092025/Documents/ПоступлениеТовараНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеТовараНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товар</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спред</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТовара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

XML_LAST_19092025/Documents/ПоступлениеТовараНаСклад/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПродажиПриИзменении(Элемент)
	РассчитатьСпред();
	РассчитатьСуммуТовара();
	РассчитатьСуммуНаОсновеСпреда();
	РассчитатьСуммуДокументаНаОсновеТоваров();
	ОповеститьЕслиСпредОтрицательный();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПокупкиПриИзменении(Элемент)
	РассчитатьСпред();
	РассчитатьСуммуТовара();
	РассчитатьСуммуНаОсновеСпреда();
	РассчитатьСуммуДокументаНаОсновеТоваров();
	ОповеститьЕслиСпредОтрицательный();	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьЕслиСпредОтрицательный()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущийСпред = ТекущиеДанные.Спред;
	Если ТекущийСпред < 0 Тогда
		Текст = "Номер строки %1 спред не должен быть отрицательным.";
		Шаблон = СтрШаблон(Текст, ТекущиеДанные.НомерСтроки);
		ПоказатьОповещениеПользователя(Шаблон);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуТовара()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Спред = ТекущиеДанные.Спред;
	ТекущиеДанные.СуммаТовара = Спред;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСпред()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЦенаПокупки = ТекущиеДанные.ЦенаПокупки;
	ЦенаПродажи = ТекущиеДанные.ЦенаПродажи;
	Спред = ЦенаПродажи - ЦенаПокупки;
	ТекущиеДанные.Спред = Спред;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНаОсновеСпреда()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Спред = ТекущиеДанные.Спред;
	КоличествоТовара = ТекущиеДанные.КоличествоТовара;
	СуммаТовара = Спред;		
	ТекущиеДанные.СуммаТовара = СуммаТовара * КоличествоТовара;	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокументаНаОсновеТоваров()		
	СуммаДокумента = 0;
	СуммаВсехТоваров = Объект.Товары.Итог("СуммаТовара");
	СуммаДокумента = СуммаВсехТоваров;
	Объект.СуммаДокумента = СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)	
	ВыбранныйТип  = ТипЗнч(ВыбранноеЗначение);	
	Если ВыбранныйТип = Тип("СправочникСсылка.Товар") Тогда
		ЕдиницаИзмеренияТовара = ВыбранноеЗначение.ЕдиницаИзмерения;		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
	КонецЕсли;
КонецПроцедуры
